Tekla Open API Reference for Tekla Structures 2025
WeldFilterExpressions.CustomNumber Constructor
 Initializes a new instance of the CustomNumber class.
 Namespace: Tekla.Structures.Filtering.Categories
 Assembly: Tekla.Structures (in Tekla.Structures.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public CustomNumber(
	string UserAttribute
)
Public Sub New (
	UserAttribute As String
)
Parameters
UserAttribute
Type: System.String
The user attribute to represent.
See Also
Reference
WeldFilterExpressions.CustomNumber Class
Tekla.Structures.Filtering.Categories Namespace